import random

number = random.randint(1, 100)
print('Загадывай число от 1 до 100')
print(f'Я думаю это число {number}')
num = number
min = 1
max = 100
while True:
    number1 = random.randint(min, num)
    number2 = random.randint(num, max)
    answer = input('Выбери > < или = : ')

    if answer == '=':
        print('Кожанные мешки, я снова победил!')

        print('⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄')
        print('⠄⠄⠄⠄⠄⠄⢀⣀⣀⣀⡀⠄⠄⠄⠄⠄⣠⣴⣶⣶⣶⣦⣀⠄⠄⠄⠄⠄⠄⠄')
        print('⠄⠄⠄⠄⢀⣴⣿⣿⣿⣿⣿⣦⠄⠄⠄⢰⣿⣿⣿⣿⣿⣿⣿⣆⠄⠄⠄⠄⠄⠄')
        print('⠄⠄⠄⠄⣼⣿⡿⠛⠛⣿⣿⣿⣧⠄⠄⢸⣿⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄')
        print('⠄⠄⠄⢰⣿⣿⣄⠄⠄⣸⣿⣿⣿⣆⣀⣼⣿⡟⠁⠈⢻⣿⣿⣿⣿⠄⠄⠄⠄⠄')
        print('⠄⠄⠄⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣤⣾⣿⣿⣿⣿⡄⠄⠄⠄⠄')
        print('⠄⠄⢠⣿⣿⣿⣿⣿⣿⣿⡿⠿⢿⣿⣿⣿⡿⠿⠿⠿⣿⣿⣿⣿⣿⣿⣦⡀⠄⠄')
        print('⠄⠄⣿⠿⠛⠉⠉⠉⠉⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠉⠉⠙⣿⣿⣷⠄⠄')
        print('⠄⠄⣿⣷⣆⠄⠐⠄⣄⣠⡄⣠⣤⡄⣴⣦⣀⣤⣠⣴⢰⠄⠄⢀⣴⣿⣿⣿⣧⠄')
        print('⠄⠄⣿⣿⣿⣆⠄⠄⠈⣈⠃⠻⢿⡷⣿⣿⠿⠋⠉⠁⠄⠄⠄⣿⣿⣿⣿⣿⣿⠄')
        print('⠄⠄⣿⣿⣿⣿⣦⣀⠄⠈⠙⠾⠿⢿⠿⠿⠿⠛⠋⠁⢀⣰⣿⣿⣿⣿⣿⣿⣿⠄')
        print('⠄⠄⢻⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣤⣤⣤⣤⣤⣤⣤⣿⣿⣿⣿⣿⣿⣿⣿⠇⠄')
        print('⠄⠄⠄⢻⣿⣿⣿⣿⣿⠿⠿⠿⣛⣛⣛⣛⣛⣋⣭⣭⣭⣭⣭⣭⣭⣝⣛⡋⠄⠄')
        print('⠄⠄⠄⠄⠿⣛⣭⣤⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠄')
        print('⠄⠄⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄')
        break
    elif answer == '<':
        print(f'Ну раз твое число меньше тогда: {number1}')
        max = num
        num = number1 + 1
    elif answer == '>':
        print(f'Ну раз твое число больше тогда: {number2}')
        min = num
        num = number2 - 1
    else:
        print('Ну уж нет, понимаю только >  < или =')
